IDENTIFICATION DIVISION.
PROGRAM-ID. BARCODE-GENERATOR.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-BARCODES PIC 9(4) COMP.
01 BARCODE PIC X(10).
01 BARCODE-TABLE.
   05 BARCODE-ITEM PIC X(10) OCCURS 0 TO 1000 TIMES.

PROCEDURE DIVISION.
* Get the number of barcodes to generate
DISPLAY "Enter the number of barcodes to generate: "
ACCEPT NUM-BARCODES

* Generate the barcodes
PERFORM VARYING I FROM 1 BY 1
   UNTIL I > NUM-BARCODES
   MOVE FUNCTION RANDOM(10) TO BARCODE
   MOVE BARCODE TO BARCODE-TABLE(I)
END-PERFORM

* Print the barcodes
PERFORM VARYING I FROM 1 BY 1
   UNTIL I > NUM-BARCODES
   DISPLAY BARCODE-TABLE(I)
END-PERFORM

STOP RUN.
