IDENTIFICATION DIVISION.
PROGRAM-ID. PRINT-INVOICES.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
  SELECT INVOICE-FILE
    ASSIGN TO 'INVOICES.DAT'
    ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD INVOICE-FILE.
  01 INVOICE-RECORD.
    88 END-OF-FILE.
    02 INVOICE-NUMBER PIC 9(5).
    02 CUSTOMER-NAME PIC X(30).
    02 ITEM-NUMBER PIC 9(5).
    02 ITEM-DESCRIPTION PIC X(30).
    02 ITEM-QUANTITY PIC 9(5).
    02 ITEM-PRICE PIC 9(5)V99.

WORKING-STORAGE SECTION.
01 INVOICE-TOTAL PIC 9(7)V99 VALUE ZERO.
01 ITEM-TOTAL PIC 9(7)V99 VALUE ZERO.
01 LINE-COUNTER PIC 9(2) VALUE 0.

PROCEDURE DIVISION.
OPEN INPUT INVOICE-FILE.
PERFORM UNTIL END-OF-FILE
  READ INVOICE-FILE
    AT END SET END-OF-FILE TO TRUE
    NOT AT END
      ADD ITEM-QUANTITY TO ITEM-TOTAL
      MULTIPLY ITEM-QUANTITY BY ITEM-PRICE
      GIVING ITEM-TOTAL
      ADD ITEM-TOTAL TO INVOICE-TOTAL
      ADD 1 TO LINE-COUNTER
      IF LINE-COUNTER = 12
        PERFORM PRINT-INVOICE
        MOVE ZERO TO INVOICE-TOTAL
        MOVE ZERO TO LINE-COUNTER
  END-READ
END-PERFORM
PERFORM PRINT-INVOICE
CLOSE INVOICE-FILE.

PRINT-INVOICE.
DISPLAY 'INVOICE NUMBER: ' INVOICE-NUMBER.
DISPLAY 'CUSTOMER NAME: ' CUSTOMER-NAME.
DISPLAY 'ITEM NUMBER: ' ITEM-NUMBER.
DISPLAY 'ITEM DESCRIPTION: ' ITEM-DESCRIPTION.
DISPLAY 'ITEM QUANTITY: ' ITEM-QUANTITY.
DISPLAY 'ITEM PRICE: $' ITEM-PRICE.
DISPLAY 'ITEM TOTAL: $' ITEM-TOTAL.
DISPLAY 'INVOICE TOTAL: $' INVOICE-TOTAL.

STOP RUN.
